martuan/ESP32-INTI-Electronica/firmware/src/main.cpp
// All supporting functions from here...
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

void HomePage(){

	//SendHTML_Header();
	
	

	if (server.hasArg("user") && server.hasArg("pass")){//si se cambia el login
		usernameLogin = server.arg(0);//captura el username
		passwordLogin = server.arg(1);//captura el password
		
		//webpage += ("<p> Usuario logueado: " + usernameLogin + " Password: " + passwordLogin + "</p>");
		

		//validación de credenciales de acceso
		if(usernameLogin == usernameLoginEnabled1 && passwordLogin == passwordLoginEnabled1){
			//flagUsuarioHabilitado = 1;
			flagUsuarioLogueado = 1;
			//flagWebserverLibre = 0;//si coinciden las credenciales, el webserver queda en estado Ocupado
			append_page_header();
			webpage += ("<p>Usuario habilitado</p>");
			webpage += ("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos'></form>");

		}else{

			//flagUsuarioHabilitado = 0;
			flagUsuarioLogueado = 0;
			append_page_header();
			webpage += ("<p>Usuario incorrecto</p>");
			webpage += F("<p>Debe loguearse</p>");
			webpage += ("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos' disabled></form>");
		}
	}else{

		append_page_header();
		webpage += F("<p>Debe loguearse</p>");
	}



  
	fechaEnsayoConsultada = "";
	/*
	if(flagUsuarioLogueado == 0){//si no hay usario habilitado, debe loguearse
	//if(flagUsuarioHabilitado == 0){//si no hay usario habilitado, debe loguearse

		webpage += F("<p>Debe loguearse</p>");	


	}else{//si ya está logueado

		webpage += F("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos'></form>");

	}
*/
//   if(flagWebserverLibre){//si nadie está usando el webserver, no hay nadie logueado

// 	//if(flagUsuarioHabilitado){//si está logueado con un usuario habilitado

// 		webpage += F("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos'></form>");
// /*
// 	}else{
		
// 		webpage += F("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos' disabled></form>");	  
// 		webpage += F("<p>Debe estar logueado para acceder</p>");	  
	
// 	}
// */
//   }else{

// 	  webpage += F("<p>Ya hay un usuario en el webserver</p>");	  

//   }
  //webpage += F("<form action='/dir' method='post'><input type='hidden' name='directorio' id='root' value='/'><input type='Submit' value='Listado de archivos'></form>");
  append_page_footer();
  SendHTML_Content();
  SendHTML_Stop(); // Stop is needed because no content length was sent
  
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void File_Download(){ // This gets called twice, the first pass selects the input, the second pass then processes the command line arguments
  
  if (server.args() > 0 ) { // Arguments were received
    if (server.hasArg("download")){
		SD_file_download(server.arg(0));
		Serial.print("argumento = ");
		Serial.println(server.arg(0));
	} 
  }
  else SelectInput("Enter filename to download","download","download");
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void SD_file_download(String filename){

  if (SD_present) { 

	File download2 = SD.open("/"+filename);
	
	SdFile download;

	download.open(filename.c_str());

	if (download) {
		Serial.print("Existe el archivo = ");
		Serial.print(filename);
		Serial.print(" ");

		//Serial.println(String(download.name()));
		Serial.println("Se descarga el archivo");
		Serial.println();
		
		server.sendHeader("Content-Type", "text/text");
		server.sendHeader("Content-Disposition", "attachment; filename="+filename);
		server.sendHeader("Connection", "close");
		server.streamFile(download2, "application/octet-stream");
		download.close();
		download2.close();
    }else ReportFileNotPresent("download"); 
  }else ReportSDNotPresent();
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void File_Upload(){
  Serial.println("File upload stage-1");
  append_page_header();
  webpage += F("<h3>Select File to Upload</h3>"); 
  webpage += F("<FORM action='/fupload' method='post' enctype='multipart/form-data'>");
  webpage += F("<input class='buttons' style='width:40%' type='file' name='fupload' id = 'fupload' value=''><br>");
  webpage += F("<br><button class='buttons' style='width:10%' type='submit'>Upload File</button><br>");
  webpage += F("<a href='/'>[Back]</a><br><br>");
  append_page_footer();
  Serial.println("File upload stage-2");
  server.send(200, "text/html",webpage);
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
File UploadFile; 
void handleFileUpload(){ // upload a new file to the Filing system
  Serial.println("File upload stage-3");
  HTTPUpload& uploadfile = server.upload(); // See https://github.com/esp8266/Arduino/tree/master/libraries/ESP8266WebServer/srcv
                                            // For further information on 'status' structure, there are other reasons such as a failed transfer that could be used
  if(uploadfile.status == UPLOAD_FILE_START)
  {
    Serial.println("File upload stage-4");
    String filename = uploadfile.filename;
    if(!filename.startsWith("/")) filename = "/"+filename;
    Serial.print("Upload File Name: "); Serial.println(filename);
    SD.remove(filename);                         // Remove a previous version, otherwise data is appended the file again
    UploadFile = SD.open(filename, FILE_WRITE);  // Open the file for writing in SPIFFS (create it, if doesn't exist)
    filename = String();
  }
  else if (uploadfile.status == UPLOAD_FILE_WRITE)
  {
    Serial.println("File upload stage-5");
    if(UploadFile) UploadFile.write(uploadfile.buf, uploadfile.currentSize); // Write the received bytes to the file
  } 
  else if (uploadfile.status == UPLOAD_FILE_END)
  {
    if(UploadFile)          // If the file was successfully created
    {                                    
      UploadFile.close();   // Close the file again
      Serial.print("Upload Size: "); Serial.println(uploadfile.totalSize);
      webpage = "";
      append_page_header();
      webpage += F("<h3>File was successfully uploaded</h3>"); 
      webpage += F("<h2>Uploaded File Name: "); webpage += uploadfile.filename+"</h2>";
      webpage += F("<h2>File Size: "); webpage += file_size(uploadfile.totalSize) + "</h2><br>"; 
      append_page_footer();
      server.send(200,"text/html",webpage);
    } 
    else
    {
      ReportCouldNotCreateFile("upload");
    }
  }
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

